/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "设置账号";
"you_need_an_account" = "设备上并无 $appname 账号，请先设置账号。";

//Login Screen
"testing_connection" = "正在测试连接";
"server_instance_not_found" = "无法找到服务器";
"secure_connection_established" = "成功建立安全连接";
"https_non_secure_connection_established" = "成功重定向到非安全连接";
"connection_established" = "成功建立连接";
"login_details" = "登录信息";
"username" = "用户名";
"password" = "密码";
"login" = "登录";
"cancel" = "取消";
"error_login_message" = "用户名或密码错误";
"ok" = "OK";
"url_sample" = "服务器地址 https://...";
"forbidden_characters_in_password" = "密码中包含不可用的字符";
"server" = "服务器";
"url" = "URL";
"session_expired" = "会话已失效";
"credentials_different_user" = "输入用户与此帐户的用户不符";
"auth_unsupported_auth_method" = "服务器不支持这种验证方式";
"saml_server_does_not_give_user_id" = "服务器无法返回一个正确的用户ID，请联系管理员";
"authentification_not_valid" = "当前服务器验证失败";
"error_too_many_http_redirects" = "建立连接时发生错误，请稍后再试。";
"retry" = "重试";
"help_link_login" = "亲，刚用 $appname 吗？";

//TabBarItems
"settings"="设置";
"files_tab"="文件";

//Uploading
"upload" = "上传";
"account" = "账号";
"location" = "位置：";
"photo_albums" = "相册";
"loading" = "载入中....";
"no_access_to_gallery" = "请为 $appname 启用获取设备照片和视频的权限，启用方法：设置>隐私>照片。";
"error" = "错误";
"upload_failed"="上传失败";
"redirection_problem"="不支持URL重定向功能";

//First View
"menu_upload" = "上传照片/视频";
"menu_folder" = "增加文件夹";
"menu_text_file" = "创建文本文件";
"sort_menu_title" = "排序";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "最新 - 最早";

//Create/Edit File Text
"create_text_file" = "创建文本文件";
"title_view_new_text_file" = "新文本文件";
"title_view_edit_text_file" = "编辑文件文件";
"default_text_file_title" = "新文本文件";
"title_text_file_placeholder" = "标题...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "已经存在";
"error_file_name_empty" = "文件名不能为空。";
"no_changes_made" = "没有造成任何改变";
"no_file_downloaded" = "文件还没有下载，你不能编辑它。";


//Create Folder
"create_folder" = "新建文件夹";
"folder_name" = "文件夹名称：";
"save" = "保存";
"folder_exist" = "给定文件夹名称已经存在，请输入其他名称。";
"folder_create_error"="无法创建文件夹";
"not_show_potrait"="菜单在横屏视图不可用，请改为竖屏视图。";
"not_possible_create_folder" = "文件夹无法创建。";

//FilesView
"confirm_to_delete_item" = "确认删除";
"yes" = "是";
"no" = "否";
"delete_from_device" = "你确认要从这台设备删除该文件吗？";
"delete_from_server" = "你确认要从服务器删除该文件吗？";
"not_possible_connect_to_server" = "现在无法连接到服务器。";
"delete_folder_from_server" = "你确认要从服务器删除该文件夹吗？";
"delete_local_server" = "从设备和服务器删除";
"delete_local" = "从设备删除";
"delete_server" = "从服务器删除";
"error_path" = "无法打开文件夹，请确认它存在";
"error_not_permission" = "你没有权限来完成这个操作";
"folders" = "文件夹";
"files" = "文件";
"folder" = "文件夹";
"file" = "文件";
"more_swipe" = "更多";
"message_not_files" = "这里还什么都没有。上传些东西吧！";

//Refresh file list
"release_refresh"="松开刷新...";
"loading_refresh"="载入中....";
"pull_down_refresh"="下拉刷新。";

//Miscelanea
"back" = "返回";

//Preview
"open_with_label" = "打开";
"delete_label"= "删除";

//Open with
"file_cannot_be_opened" = "文件无法打开";
"no_app_instaled_to_open_it" = "未安装打开该类型文件的应用。";

//WTClient messages (Download/Upload)
"establishing_connection" = "建立连接";
"not_establishing_connection" = "无法建立连接";
"connection_closed" = "停止连接";
"connection_lost" = "连接丢失";
"auth_failed" = "认证失败。";
"auth_passed" = "认证通过";
"request_file_not_found" = "请求的文件在服务器上未找到";
"request_file_not_accesed" = "请求的文件无法地获取";
"unknow_response_server" = "错误。来自服务器的意外响应。";
"uploading_data" = "上传中...";
"downloading_data" = "下载中...";
"transfer_complete" = "迁移完成";
"transfer_failed" = "迁移失败";

//Settings and PinCode
"title_app_pin" = "密码";
"title_app_pin_and_touchID" = "密码和指纹识别";
"enter_app_pin" = "输入密码";
"enter_app_pin_long_description" = "输入密码";
"reenter_app_pin" = "再次输入密码";
"remove_app_pin" = "移除密码";
"both_pass_not_same" = "输入的密码不相同";
"app_pin_incorrect" = "密码不正确";
"passcode_not_enabled" = "请先启用密码";
"title_app_touchID" = "指纹识别";
"disconnect_button" = "与服务器断开连接";
"pin_removed" = "移除的密码";
"incorrect_pin" = "错误的密码";
"app_pin_stored" = "存储的密码";
"help" = "帮助";
"recommend_to_friend" = "推荐给朋友";
"send_feedback" = "发送反馈";
"manage_accounts" = "管理账号";
"add_new_account" = "添加新账号";
"save_changes" = "保存";
"add_account" = "增加";
"user_exist" = "输入的用户已经存在";
"imprint_button" = "公司信息";
"title_instant_upload_photos"="即时上传照片";
"title_instant_upload_videos"="即时上传视频";
"title_background_instant_upload" = "后台即时上传";
"accounts_section" = "账号";
"security_section" = "安全";
"instant_updloads_section" = "即时上传";
"more_section" = "更多";
"unlock_app" = "解锁 $appname";

//Downloading
"can_no_copy_to_gallery" = "文件无法复制到图库，因为无法打开图库";
"file_is_downloading" = "文件已经正在下载";
"download_file_exist" = "无法打开文件，请确认它存在s";
"wait_to_download" = "正在准备下载";
"updating" = "正在更新....";
"msg_while_downloads" = "无法完成操作，请等待现有下载任务完成";

//SSL
"invalid_ssl_cert" = "无法验证网站的身份，你无论如何要信任此证书吗？";
"connection_declined" = "连接被用户降低";

//Recent view
"recent_now"="刚刚";
"recent_minutes"="$minutes 分钟前";
"recent_minute"="$minutes 分钟前";
"recent_hours"="$hours 小时前";
"recent_hour"="$hours 小时前";
"recent_days"="$days 天前";
"recent_day"="$days 天前";
"recent_months"="$months 月前";
"recent_month"="$months 月前";

"uploads_tab"="上传";
"current_section"="当前";
"uploader_section"="已上传";
"nothing_was_upload_recently"="最近没有从设备上传任何文件";
"failed_uploader_section"="上传失败";
"clear_successful"="清除";
"error_credential"="凭证错误";
"error_destiny_does_not_exist"="文件夹错误";
"error_file_exists"="冲突错误";
"error_permission" = "权限错误";
"error_file_does_not_exist" = "文件错误";
"error_file_in_background" = "服务器错误";
"error_file_invalid_characters" = "无效的字符";
"change_active_user"="切换当前用户到";
"waiting_for_server"="等待服务器连接";
"waiting_for_upload"="等待上传...";
"error_permission_alert_message" = "你没有权限上传到该文件夹";
"choose_folder" = "选择目录";

//Select Folder View
"upload_label"="上传至";
"create_button"="创建";
"choose_button"="选择...";

//Rename
"rename_long_press" = "重命名";
"rename_file_title" = "重命名";
"enter_new_name" = "新的名字：";
"rename_file_exist" = "给定文件名称已经存在，请输入不同名称。";

//Move
"move_long_press" = "移动";
"move_to_label" = "移动到";
"file_exist" = "该文件已经存在在目标文件夹";
"override_file" = "你要用这个替换已存在的吗？";
"accept" = "接受";
"error_folder_destiny_is_the_same" = "错误：不能移动文件夹到自身";
"original_file_exist" = "无法移动文件，请确认它存在";
"original_folder_exist" = "无法移动文件夹，请确认它存在";

//Download folfer
"download_folder" = "下载文件夹";
"cancel_download" = "取消下载";

//Upload from other apps
"other_apps_title" = "目标位置";
"other_apps_account" = "账户";
"other_apps_folder" = "文件夹";
"other_apps_file_name" = "文件名";
"other_apps_send_to" = "上传到";
"error_moving_file" = "无法移动文件，请确认目标文件夹存在";
"forbidden_characters_from_server" = "名称至少包含一个非法字符";
"overwritte_title" = "覆盖";

//Social
"twitter_message" = "在您的智能手机上尝试 $twitteruser ！ ";
"facebook_message" = "在您的智能手机上尝试 $appname ！\r\n";
"mail_recommendation_subject" = "在您的智能手机上尝试 $appname ！";
"mail_recommendation_body" = "我想邀请您在您的智能手机上使用 $appname ！\r\n这里下载 ";
"device_not_support_mail" = "请配置您的邮箱账号";
"mail_feedback_subject" = "反馈 $appname";
"account_not_configure" = "设备没有配置这个账号，到设置配置它。";

//Storage
"of_storage" = "在";
"occupied_storage" = "已占用";
"storage" = "存储";
"storage_upgrade" = "增加空间";

//Jimmies
"this_file_is_older" = "有新版本";
"msg_update_file_0_bytes" = "服务器上的文件是 0 字节。要用这个空白文件覆盖设备上已存在的文件吗？";

//Shared
"shared_tab" = "分享链接";
"message_not_shared_files" = "还没有通过链接分享文件和文件夹";
"message_not_shared_api_support" = "对不起，服务器上分享未启用，请联系管理员。";
"share_link_long_press" = "共享";
"unshare_link" = "取消共享链接";
"share_not_available_on_this_server" = "对不起，此功能在服务上未启用，请联系管理员。";
"copy_link" = "复制链接";
"file_to_share_not_exist" = "文件(夹)无法分享，请确认它存在";
"file_to_unshare_not_exist" = "文件(夹)无法取消分享，请确认它存在";
"shared_link_protected_title" = "输入密码";
"shared_link_protected_message" = "必须输入密码保护来分享的链接。";
"pasword_empty" = "密码不能为空白";
"no_pasword" = "必须输入密码";
"get_share_link" = "获取分享链接";
"set_expiration_time" = "设置过期时间";
"password_protect" = "密码保护";
"allow_editing" = "允许编辑";
"default_not_possible_msg" = "无法完成这个操作，请稍后再试";
"share_user_group_indicator" = "群组";
"share_user_federated_indicator" = "远程";
"add_user_or_group_title" = "添加用户或用户组";
"share_with_users_or_groups" = "分享给用户或者用户组";
"not_share_with_users_yet"= "还没有同任何用户分享";
"not_sharee_api_supported" = "对不起，服务器版本不允许与用户分享，请联系管理员。";
"share_link_title" = "分享链接";
"not_share_link_enabled_capabilities" = "服务器上分享链接功能未启用，请联系管理员。";
"shared_link_cannot_remove_password" = "无法移除密码";
"shared_link_cannot_remove_expiration_date" = "无法清除到期日期，分享需要设有到期日期";
"shared_link_mail_subject" = "$userName 分享 »$fileOrFolderName« 给您";
"secured_link" = "安全";

//Shared privileges
"title_user_can_edit" = "可编辑";
"title_user_can_share" = "可共享";
"user_can_create" = "创建";
"user_can_change" = "更改";
"user_can_delete" = "删除";
"title_view_edit_user_privileges" = "特权";

//Favorites
"favorite" = "收藏";
"unfavorite" = "取消收藏";
"parent_folder_is_favorite" = "包含该文件的文件夹已经收藏";

//Available offline
"available_offline" = "脱机工作";
"not_available_offline" = "取消脱机工作";
"parent_folder_is_available_offline_file_child" = "包含该文件的文件夹已经脱机工作";
"parent_folder_is_available_offline_folder_child" = "包含该文件夹的文件夹已经脱机工作";

//Document provider
"error_login_doc_provider" = "无法获取您你的账号，请先使用 $appname 应用登录。";
"error_sending_file_to_document_picker" = "发送文件到文件选择器错误";
"error_user_change_in_core_app" = "$appname 应用的用户已经改变";
"error_connecting_with_server" = "无法连接服务器，请问稍后再试吗？";
"move_doc_provider_button" = "移动到这个位置";
"export_doc_provider_button" = "导出到这个位置";

//Instant uploads
"location_not_enabled"="定位服务未启用";
"message_location_not_enabled"="请到设置中打开定位服务，以启用后台照片即时上传。";
"access_photos_library_not_enabled" = "无法获取照片";
"message_access_photos_not_enabled" = "请到设置中打开照片获取权限，以启用照片即时上传。";

//PDF reader
"page_of_pages" = "在"; //Example: 5 of 10

//Share in
"files_added" = "文件已添加";
"files_will_be_upload_next_time" = "下次打开 $appname 时，文件将开始上传";

//Help Guide main app
"title_help_slide_0" = "$appname 欢迎您！";
"message_help_slide_0" = "滑动了解更多";
"title_help_slide_1" = "即时上传";
"message_help_slide_1" = "保证您的照片安全";
"title_help_slide_2" = "管理您所有的文件";
"message_help_slide_2" = "您可以删除，移动";
"title_help_slide_3" = "共享";
"message_help_slide_3" = "您可以分享文件和文件夹";
"title_help_slide_4" = "多账户";
"message_help_slide_4" = "连接您所有的云";
"title_help_slide_5" = "您的私有文件同步到任何地方";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "登录";
"skip_button_help_guide" = "跳过";

//Account menu
"menu_account_edit" = "编辑账号";
"menu_account_clear_cache" = "清除缓存";
"menu_account_log_out" = "删除账号";
